<template>
  <q-page class="column">
    <q-card
      bordered
      class="col q-ma-sm q-pa-md">
      <h4>О сайте</h4>
      <p>
        Этот сайт задуман для удобного доступа и отыгрыша пакетов
        <a rel="external" target="_system" href="https://ru.wikipedia.org/wiki/%D0%A7%D1%82%D0%BE%3F_%D0%93%D0%B4%D0%B5%3F_%D0%9A%D0%BE%D0%B3%D0%B4%D0%B0%3F_(%D1%81%D0%BF%D0%BE%D1%80%D1%82%D0%B8%D0%B2%D0%BD%D0%B0%D1%8F_%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D1%8F)#%D0%9C%D0%B5%D0%B6%D0%B4%D1%83%D0%BD%D0%B0%D1%80%D0%BE%D0%B4%D0%BD%D0%B0%D1%8F_%D0%B0%D1%81%D1%81%D0%BE%D1%86%D0%B8%D0%B0%D1%86%D0%B8%D1%8F_%D0%B8%D0%BD%D1%82%D0%B5%D0%BB%D0%BB%D0%B5%D0%BA%D1%82%D1%83%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D1%85_%D0%B8%D0%B3%D1%80_(%D0%9C%D0%90%D0%98%D0%98)">спортивного
        Что? Где? Когда?</a>.
        Все вопросы скачиваются из <a rel="external" target="_system" href="https://db.chgk.info/">Базы Вопросов</a>
        с помощью <a rel="external" target="_system" href="http://api.baza-voprosov.ru/">интерфейса</a>.
      </p>
      <p>
        Если у вас не получается удобный доступ, напишите автору сайта, <a href="mailto:pawel.sirotkin@gmail.com">Паше Сироткину</a>. Он постарается что-нибудь придумать.
      </p>
      <p>
        Если у вас не получается отыгрыш, напишите редактору. Он наверняка тоже постарается что-нибудь придумать.
      </p>
    </q-card>
    <q-card
    id="releaseNotes"
      bordered
      class="col q-ma-sm q-pa-md">
      <h4 class="q-ma-xs">Версии</h4>
      <h5 class="q-ma-none">1.2.2 (03 декабря 2022)</h5>
      <div class="q-ma-none">
        <ul class="q-ma-xs">
          <li>
            Исправлено обращение к API базы вопросов. Спасибо Юре.
          </li>
        </ul>
      </div>
      <h5 class="q-ma-none">1.2.1 (17 ноября 2022)</h5>
      <div class="q-ma-none">
        <ul class="q-ma-xs">
          <li>
            Исправлены несколько ошибок при отображении названий пакетов.
          </li>
          <li>
            На стартовой странице пакета в мобильной версии добавлена анимация, а то Лёша не понимал, куда свайпить.
          </li>
        </ul>
      </div>
      <h5 class="q-ma-none">1.2.0 (9 декабря 2020)</h5>
      <div class="q-ma-none">
        <ul class="q-ma-xs">
          <li>
            Исправлены ошибки при отображении раздаток в формате JPEG (спасибо Юре за наводку, и Але вообще-то) и переходе на
            следующий тур.
          </li>
          <li>
            В настройках теперь можно стереть все скачанные пакеты.
          </li>
        </ul>
      </div>
      <h5 class="q-ma-none">1.1.0</h5>
      <div class="q-ma-none">
        <ul class="q-ma-xs">
          <li>
            Пакет помечается как отыгранный (галочка в списке), когда был просмотрен ответ на последний вопрос.
          </li>
          <li>
            Оповещение об успешном обновлении.
          </li>
        </ul>
      </div>
      <h5 class="q-ma-none">1.0.0</h5>
      <p class="q-ma-none q-ml-lg">Первая публичная версия.</p>
    </q-card>
    <q-card
      bordered
      class="col q-ma-sm q-pa-md">
      <h4>О защите личных данных</h4>
      <p>
        Сайт использует
        <a rel="external" target="_system" href="https://ru.wikipedia.org/wiki/Cookie">куки</a> для аналитики с помощью программы
        <a rel="external" target="_system" href="https://ru.wikipedia.org/wiki/Matomo">Matomo</a>.
        <br />
        Просто говоря, я смотрю, на какие страницы сайта заходят посетители, сколько времени они там проводят и т.д.
        <br />
        При этом собираются такие данные, как ваш браузер, операционная система, IP (последние два октета спрятаны) и т.п.
        <br />
        Данные хранятся на сервере в ЕС и никому не передаются. Да что уж там, я и сам их не то чтобы особо детально смотрел.
      </p>
      <p>Вот Ваш актуальный статус:</p>
      <p q-mb-none q-pb-none>
        <iframe
        style="border: 0; width: 50%;"
        src="https://www.psirotkin.net/analytics/index.php?module=CoreAdminHome&action=optOut&language=ru&backgroundColor=&fontColor=&fontSize=16px&fontFamily='Roboto', '-apple-system', 'Helvetica Neue', Helvetica, Arial, sans-serif"
        ></iframe>
      </p>
    </q-card>
    <q-card
      bordered
      class="col q-ma-sm q-pa-md text-body2">
      <h4>Лицензия на использование вопросов из Базы Вопросов Интернет-клуба "Что? Где? Когда?"</h4>
      <p>
        <em>Исходная лицензия: <a rel="external" target="_system" href="https://db.chgk.info/copyright">https://db.chgk.info/copyright</a></em>
      </p>
      Интернет-клуб "Что? Где? Когда?" предоставляет пользователям Базы Вопросов право:
      <ul>
        <li>
          использовать эти вопросы (1) для тренировок и проведения турниров местного характера при условии, что указывается с полным URL (2) их источник - База Вопросов
          Интернет-клуба "Что? Где? Когда?";
        </li>
        <li>
          публиковать эти вопросы в традиционных и электронных средствах массовой информации в некоммерческих целях при условии, что указывается с полным URL их источник
          - База Вопросов Интернет-клуба "Что? Где? Когда?";
        </li>
        <li>
          распространять любой пакет вопросов из Базы Вопросов, в том числе и случайно сгенерированный (3), по желанию пользователя при условии, что в него не вносятся
          посторонние вопросы, указывается с полным URL их источник - База Вопросов Интернет-клуба "Что? Где? Когда?" и прилагается текст данной Лицензии.
        </li>
      </ul>
      <strong>Предупреждение</strong>: подавляющее большинство вопросов Базы Вопросов были играны или другим образом распространялись по многим городам как в СССР/СНГ,
      так и за его пределами. Подавляющее большинство вопросов Базы Вопросов собрано из общедоступных источников, не предохраненных авторским правом, или же
      с разрешения держателей авторского права на распространение вопросов в сети Интернет. В связи с этим Интернет-клуб "Что? Где? Когда?" не несет
      никакой ответственности за:
      <ul>
        <li>
          использование вопросов Базы Вопросов в турнирах;
        </li>
        <li>
          корректность вопросов в Базе Вопросов;
        </li>
        <li>
          проблемы с авторскими правами, возникающие между пользователями Базы Вопросов и авторами вопросов.
        </li>
      </ul>
      В соответствии с настоящей Лицензией НЕ ДОПУСКАЕТСЯ:
      <ul>
        <li>
          внесение любых изменений в содержание этих вопросов;
        </li>
        <li>
          использование этих вопросов для индивидуальных или командных взносов пользователей в оргкомитеты турниров;
        </li>
        <li>
          любое использование этих вопросов без указания с полным URL их источника - Базы Вопросов Интернет-клуба "Что? Где? Когда?";
        </li>
        <li>
          распространение любых пакетов из Базы Вопросов, в том числе и случайно сгенерированных, без приложения текста данной Лицензии;
        </li>
        <li>
          любое использование этих вопросов с коммерческой целью;
        </li>
        <li>
          использование материалов этих вопросов для написания любых текстов с коммерческой целью.
        </li>
      </ul>
      <strong>Примечания</strong>
      <ol>
        <li>
          Под словом "Вопрос" в данной Лицензии подразумевается полный текст полей "Вопрос", "Ответ", "Источник" и "Автор" в Базе Вопросов.
        </li>
        <li>
          http://db.chgk.info
        </li>
        <li>
          Распространение вопросов из тренировочного пакета клуба "Мозговорот" допускается только на основе Лицензии, прилагаемой к означенному пакету.
        </li>
        <li>
          Распространение вопросов Ильи Бера допускается на основе лицензии CC BY-ND 4.0.
        </li>
        <li>
          Распространение вопросов Александра Печеного, Владислава Короля и Владимира Цвингли допускается на основе лицензии BY-NC-SA 4.0.
        </li>
        <li>
          Распространение вопросов Ксении и Эдуарда Шагалов, Ильи Немца, Бориса Окуня, Андрея Петухова, Ивана Семушина, команды «Борский корабел»,
          Павла Солахяна, Владимира Островского, Максима Мерзлякова, Александра Коробейникова, Сергея Спешкова, Виктории Маландиной, Эдуарда Голуба,
          Артёма Гулецкого, Марии Подрядчиковой, Евгения Сибиряка, Андрея Солдатова, Мансура Зиятдинова, команды «Зигзаг», Александра Рождествина,
          Ивана Топчия, Андрея Тананы, Дмитрия Буценца, Дмитрия Некрылова, Виталия Паутова (и турниры под его редактурой), Алексея Гончарова,
          Вадима Ермака, Юрия Разумова, Алексея Сильвестрова, Алексея Шматкова, Дмитрия Дорожко, Александра Демяненко, Александра Карясова,
          Алексея Бороненко и Натальи Яковлевой (а также турниры под их редактурой), Серафима Шибанова, Руслана Алиева (и турниры под его редактурой),
          Владимира Осипчука, Артёма Матухно, Вячеслава Гарановича, Екатерины Лобковой, Константина Брифа (а также турниры под его редактурой),
          Ивана Ерёмина (а также турниры под его редактурой), Вадима Кузмича допускается на основе лицензии CC BY-NC-ND 4.0.
        </li>
        <li>
          Вопросы турниров «Кубок Физтеха» и «Малый кубок Физтеха», начиная с 2015 года, могут использоваться только на некоммерческой основе.
        </li>
      </ol>
      <em>По всем вопросам, связанным с использованием Базы Вопросов, просьба обращаться к <a href="mailto:kostyaknop@gmail.com">Константину Кнопу</a>.</em>
      <br />
      1997-2020
    </q-card>
  </q-page>
</template>

<script>
import { mapState, mapActions } from 'vuex'

export default {
  name: 'Settings',
  data () {
    return {
    }
  },
  methods: {
    updateSettings (value, event) {
      const newSetting = {
        attribute: event.target.id,
        value: value
      }
      this.setSetting(newSetting)
    },
    ...mapActions('ui', ['setSetting', 'setTitle'])
  },
  computed: {
    ...mapState('ui', {
      getSettings: 'settings'
    }),
    settings () {
      return this.getSettings
    }
  },
  created () {
    this.setTitle('Настройки')
  }
}
</script>

<style>

</style>
